Autodesk.Revit.DB.Grid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Line)
Creates a new grid line.
Remarks:
The line should be on a horizontal plane.
document:
The document in which the new instance is created.
line:
A line object which represents the location of the grid line.
Returns:
The newly created grid line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input line is not on horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Grid
Represents a single grid line within Autodesk Revit.
Remarks:
Grid lines can either be curved or straight.
The Name property can be used to retrieve the contents of the grid line's bubble.